flashsim_result/sysbench/ctoc_noshadow/nontrx_update_key_t60.out
2018. 12. 19. (수) 22:50:42 KST
[SYSBENCH] Running benchmark...
sysbench 0.4.12:  multi-threaded system evaluation benchmark

Running the test with following options:
Number of threads: 16

Doing OLTP test.
Running non-transactional test
Using Uniform distribution
Using "BEGIN" for starting transactions
Using auto_inc on the id column
Threads started!
Time limit exceeded, exiting...
(last message repeated 15 times)
Done.

OLTP test statistics:
    queries performed:
        read:                            0
        write:                           437638
        other:                           0
        total:                           437638
    transactions:                        437638 (7291.66 per sec.)
    deadlocks:                           0      (0.00 per sec.)
    read/write requests:                 437638 (7291.66 per sec.)
    other operations:                    0      (0.00 per sec.)

Test execution summary:
    total time:                          60.0190s
    total number of events:              437638
    total time taken by event execution: 959.8680
    per-request statistics:
         min:                                  0.11ms
         avg:                                  2.19ms
         max:                                191.91ms
         approx.  95 percentile:              15.73ms

Threads fairness:
    events (avg/stddev):           27352.3750/41.54
    execution time (avg/stddev):   59.9917/0.00

2018. 12. 19. (수) 22:51:42 KST

----------------------------------------------------------

mutex_t : 0x196e2ea8 q:0x196e2ea0, size:2048
mutex_t : 0x196e3478 q:0x196e3470, size:1024
mutex_t : 0x196e34d8 q:0x196e34d0, size:1024
mutex_t : 0x196e3538 q:0x196e3530, size:1024
nohost: [dm_nohost_probe] PROBE STARTED
Initializing Connectal & DMA...
subprocess pid 10994 completed status=0 0
[initPortalHardwareOnce:270] fd 5 len 0
[checkSignature:167] read status from '/dev/connectal' was only 0 bytes long
checkSignature: driver 'zynqportal.c' signature mismatch 3431c6f01fcc1c478c8187d1e6992edc e059016ac411386d6e2597d43bc49e15
checkSignature: driver 'portalmem.c' signature mismatch 0ba7c77e370fade81cfa5a0e5abb92f0 eef0fb3bacb31283d694f7aef3d380b3
Main::allocating memory...
USE_ACP = FALSE
USE_ACP = FALSE
Main::allocating memory finished!
[dmaManagerOnce:44]
Requested FCLK[0]=200000000 actually 200000000
Requested Freq: 200.00, Actual Freq: 200.00, status=0
LOG: DEBUG DUMP: gearSend = -580840893, gearRec = 1980615261, aurSend = -660972623, aurRec = 59840773, readSend=824120606, writeSend=1154342732
nohost: [dm_nohost_probe] PROBE DONE!
nohost: [dm_nohost_open] open done!
!!! print info !!!
Async status: 1
use wirte buffer: 1
Wait same mapping request(FLYING): 0
use gc polling: 0
use eviction polling: 0
# of total block: 512
# of total page: 8388608
page per block: 16384
# of translation block: 2
# of translation page: 32768
# of data block: 508
# of data page: 8323072
# of total cache mapping entry: 4096
max # of ram reside cme: 1024
max # of clean translation cache table: 512
cache percentage: 25.000%
!!! print info !!!
BM_Init() End!
mutex_t : 0x19703378 q:0x19703370, size:1024
mutex_t : 0x19709ef8 q:0x19709ef0, size:1024
mutex_t : 0x19709f58 q:0x19709f50, size:1024
_nos:512
bad_block_checking...[ 99.998474 ]
badblock_cnt: 90
_RNOS:4096
bad block 294912 -> 67092480
bad block 737280 -> 67076096
bad block 770048 -> 67059712
bad block 802816 -> 67043328
bad block 835584 -> 67026944
bad block 1474560 -> 67010560
bad block 1490944 -> 66994176
bad block 1884160 -> 66977792
bad block 2359296 -> 66961408
bad block 4620288 -> 66945024
bad block 5783552 -> 66928640
bad block 5931008 -> 66912256
bad block 6520832 -> 66895872
bad block 6619136 -> 66879488
bad block 8896512 -> 66863104
bad block 9060352 -> 66846720
bad block 9191424 -> 66830336
bad block 11255808 -> 66813952
bad block 12763136 -> 66797568
bad block 13467648 -> 66781184
bad block 13533184 -> 66764800
checking done!
server waiting.....
connected!!!
tpage_GC()

WAF: 1.37
tpage_GC()
tpage_GC()

WAF: 1.38
tpage_GC()
tpage_GC()

WAF: 1.37
tpage_GC()
tpage_GC()
tpage_GC()

WAF: 1.37
tpage_GC()
tpage_GC()

WAF: 1.37
tpage_GC()
tpage_GC()

WAF: 1.36
tpage_GC()
tpage_GC()

WAF: 1.36
tpage_GC()
tpage_GC()

WAF: 1.36
tpage_GC()
tpage_GC()

WAF: 1.35
tpage_GC()
tpage_GC()

WAF: 1.35
tpage_GC()
tpage_GC()

WAF: 1.35
tpage_GC()
^C


[cdf]read---
60	2	0.000002
90	1	0.000003
120	726	0.000633
130	14169	0.012928
140	31437	0.040207
150	22954	0.060126
160	18413	0.076104
170	23075	0.096127
180	26860	0.119435
190	26587	0.142506
200	23460	0.162863
210	21293	0.181340
220	21608	0.200091
230	21957	0.219144
240	21748	0.238016
250	19703	0.255113
260	17612	0.270396
270	19938	0.287697
280	27461	0.311526
290	30822	0.338272
300	32647	0.366602
310	33803	0.395934
320	32924	0.424504
330	32893	0.453047
340	35878	0.484180
350	39292	0.518276
360	39376	0.552445
370	36866	0.584435
380	34690	0.614538
390	35967	0.645748
400	36190	0.677152
410	35557	0.708007
420	32638	0.736328
430	29315	0.761766
440	27825	0.785912
450	27005	0.809345
460	25253	0.831259
470	22497	0.850780
480	19689	0.867866
490	18087	0.883561
500	16373	0.897768
510	14698	0.910523
520	13168	0.921949
530	11704	0.932105
540	9819	0.940626
550	8873	0.948325
560	7852	0.955139
570	6813	0.961051
580	6052	0.966303
590	5182	0.970799
600	4404	0.974621
610	3933	0.978034
620	3354	0.980944
630	2870	0.983435
640	2457	0.985567
650	2093	0.987383
660	1880	0.989014
670	1620	0.990420
680	1419	0.991651
690	1172	0.992668
700	1035	0.993567
710	844	0.994299
720	776	0.994972
730	726	0.995602
740	565	0.996092
750	527	0.996550
760	455	0.996945
770	385	0.997279
780	293	0.997533
790	297	0.997791
800	236	0.997995
810	196	0.998166
820	178	0.998320
830	147	0.998448
840	121	0.998553
850	115	0.998652
860	98	0.998737
870	88	0.998814
880	83	0.998886
890	62	0.998940
900	41	0.998975
910	46	0.999015
920	35	0.999045
930	33	0.999074
940	26	0.999097
950	24	0.999117
960	24	0.999138
970	23	0.999158
980	20	0.999176
990	15	0.999189
1000	12	0.999199
1010	12	0.999209
1020	9	0.999217
1030	4	0.999221
1040	4	0.999224
1050	10	0.999233
1060	8	0.999240
1070	7	0.999246
1080	12	0.999256
1090	7	0.999262
1100	2	0.999264
1110	3	0.999267
1120	4	0.999270
1130	11	0.999280
1140	7	0.999286
1150	5	0.999290
1160	4	0.999294
1170	4	0.999297
1180	12	0.999308
1190	6	0.999313
1200	10	0.999321
1210	10	0.999330
1220	13	0.999341
1230	15	0.999354
1240	6	0.999360
1250	1	0.999360
1260	3	0.999363
1270	5	0.999367
1280	3	0.999370
1290	3	0.999373
1350	1	0.999373
1380	1	0.999374
1390	1	0.999375
1400	1	0.999376
1430	1	0.999377
1440	1	0.999378
1460	2	0.999380
1470	2	0.999381
1490	1	0.999382
1500	1	0.999383
1510	2	0.999385
1520	2	0.999386
1530	1	0.999387
1550	3	0.999390
1560	2	0.999392
1570	4	0.999395
1580	3	0.999398
1590	4	0.999401
1600	1	0.999402
1610	1	0.999403
1620	2	0.999405
1630	3	0.999407
1640	3	0.999410
1650	1	0.999411
1660	1	0.999412
1670	2	0.999413
1680	2	0.999415
1690	1	0.999416
1700	2	0.999418
1710	2	0.999419
1720	3	0.999422
1730	3	0.999425
1740	8	0.999432
1750	2	0.999433
1760	1	0.999434
1770	4	0.999438
1780	3	0.999440
1790	2	0.999442
1800	2	0.999444
1810	4	0.999447
1820	2	0.999449
1840	1	0.999450
1850	1	0.999451
1860	1	0.999452
1890	1	0.999452
1900	3	0.999455
1910	2	0.999457
1970	2	0.999459
1990	2	0.999460
2010	1	0.999461
2030	1	0.999462
2040	2	0.999464
2060	1	0.999465
2080	2	0.999466
2090	2	0.999468
2120	1	0.999469
2130	1	0.999470
2140	1	0.999471
2150	1	0.999472
2160	1	0.999472
2180	1	0.999473
2220	1	0.999474
2380	1	0.999475
2390	1	0.999476
2480	2	0.999478
2490	1	0.999478
2500	2	0.999480
2510	4	0.999484
2520	3	0.999486
2550	1	0.999487
2580	1	0.999488
2630	2	0.999490
2670	3	0.999492
2680	2	0.999494
2690	2	0.999496
2700	2	0.999498
2710	1	0.999498
2720	4	0.999502
2730	3	0.999505
2740	1	0.999505
2750	2	0.999507
2760	1	0.999508
2770	4	0.999511
2780	1	0.999512
2800	3	0.999515
2810	1	0.999516
2830	1	0.999517
2840	1	0.999518
2850	1	0.999518
2880	2	0.999520
2890	2	0.999522
2900	1	0.999523
2910	1	0.999524
2920	1	0.999524
2940	1	0.999525
2950	1	0.999526
2960	2	0.999528
2970	1	0.999529
2980	1	0.999530
2990	1	0.999531
3000	1	0.999531
3010	1	0.999532
3020	2	0.999534
3030	1	0.999535
3040	1	0.999536
3050	3	0.999538
3060	2	0.999540
3070	2	0.999542
3080	1	0.999543
3090	1	0.999544
3100	3	0.999546
3110	1	0.999547
3120	1	0.999548
3150	4	0.999551
3180	1	0.999552
3240	1	0.999553
3260	1	0.999554
3280	1	0.999555
3290	1	0.999556
3310	2	0.999557
3330	1	0.999558
3350	1	0.999559
3360	5	0.999564
3380	1	0.999564
3420	2	0.999566
3430	1	0.999567
3450	1	0.999568
3490	3	0.999570
3500	3	0.999573
3520	2	0.999575
3540	1	0.999576
3550	2	0.999577
3560	2	0.999579
3570	1	0.999580
3580	1	0.999581
3590	6	0.999586
3600	1	0.999587
3610	2	0.999589
3630	1	0.999590
3640	1	0.999590
3650	1	0.999591
3660	4	0.999595
3670	2	0.999596
3690	1	0.999597
3700	6	0.999603
3740	1	0.999603
3750	2	0.999605
3760	1	0.999606
3790	1	0.999607
3810	1	0.999608
3820	2	0.999610
3850	2	0.999611
3860	1	0.999612
3870	1	0.999613
3880	4	0.999616
3890	4	0.999620
3900	2	0.999622
3910	2	0.999623
3950	1	0.999624
4040	1	0.999625
4050	3	0.999628
4060	2	0.999629
4070	2	0.999631
4080	1	0.999632
4100	3	0.999635
4120	1	0.999636
4130	2	0.999637
4140	2	0.999639
4150	5	0.999643
4160	1	0.999644
4180	2	0.999646
4190	1	0.999647
4200	2	0.999649
4210	2	0.999650
4220	4	0.999654
4230	3	0.999656
4240	2	0.999658
4250	1	0.999659
4270	1	0.999660
4330	1	0.999661
4680	1	0.999662
4720	1	0.999662
4730	2	0.999664
4740	1	0.999665
4760	2	0.999667
4780	2	0.999669
4790	1	0.999669
4810	1	0.999670
4850	1	0.999671
4920	1	0.999672
5580	1	0.999673
5610	1	0.999674
6190	3	0.999676
6200	4	0.999680
6210	1	0.999681
7330	2	0.999682
7340	1	0.999683
7350	1	0.999684
7370	2	0.999686
7390	1	0.999687
7420	1	0.999688
7430	2	0.999689
7440	5	0.999694
7450	2	0.999695
7540	1	0.999696
8010	1	0.999697
8020	1	0.999698
8040	1	0.999699
8050	1	0.999700
8110	2	0.999701
8150	2	0.999703
8160	1	0.999704
8170	2	0.999706
8180	1	0.999707
8360	1	0.999708
8420	1	0.999708
8450	2	0.999710
8480	1	0.999711
8490	3	0.999714
8540	1	0.999714
8630	1	0.999715
8940	1	0.999716
8980	2	0.999718
9020	1	0.999719
9040	3	0.999721
9050	2	0.999723
9060	2	0.999725
9070	1	0.999726
9080	1	0.999727
9090	2	0.999728
9110	1	0.999729
9120	2	0.999731
9130	2	0.999733
9140	2	0.999734
9150	2	0.999736
9190	1	0.999737
9200	1	0.999738
9280	1	0.999739
9300	4	0.999742
9310	1	0.999743
9330	1	0.999744
9340	3	0.999747
9360	1	0.999747
9370	1	0.999748
9390	2	0.999750
9400	1	0.999751
9410	2	0.999753
9420	1	0.999754
9450	4	0.999757
9460	2	0.999759
9470	1	0.999760
9480	1	0.999761
9490	1	0.999761
9500	1	0.999762
9520	2	0.999764
9530	1	0.999765
9560	1	0.999766
9570	1	0.999767
9590	1	0.999767
9610	2	0.999769
9620	4	0.999773
9630	1	0.999774
9640	2	0.999775
9650	4	0.999779
9670	4	0.999782
9680	1	0.999783
9690	1	0.999784
9710	1	0.999785
9720	2	0.999787
9730	2	0.999788
9740	3	0.999791
9750	2	0.999793
9770	1	0.999793
9800	1	0.999794
9810	1	0.999795
9870	2	0.999797
9880	1	0.999798
9890	3	0.999800
9910	1	0.999801
9940	1	0.999802
9950	1	0.999803
9960	5	0.999807
9970	1	0.999808
9980	2	0.999810
9990	4	0.999813
10000	1	0.999814
10010	1	0.999815
10050	1	0.999816
10060	1	0.999817
10070	5	0.999821
10080	1	0.999822
10090	2	0.999824
10100	2	0.999826
10110	1	0.999826
10120	3	0.999829
10130	4	0.999833
10140	3	0.999835
10160	2	0.999837
10170	3	0.999839
10190	1	0.999840
10210	2	0.999842
10220	3	0.999845
10240	3	0.999847
10250	3	0.999850
10260	2	0.999852
10270	2	0.999853
10280	2	0.999855
10310	2	0.999857
10320	4	0.999860
10330	2	0.999862
10340	5	0.999866
10350	9	0.999874
10360	1	0.999875
10370	5	0.999879
10380	1	0.999880
10400	3	0.999883
10410	1	0.999884
10420	2	0.999885
10430	6	0.999891
10450	1	0.999892
10460	1	0.999892
10480	1	0.999893
10490	2	0.999895
10500	1	0.999896
10510	2	0.999898
10520	7	0.999904
10530	2	0.999905
10540	1	0.999906
10560	5	0.999911
10570	4	0.999914
10590	5	0.999918
10600	4	0.999922
10610	1	0.999923
10620	5	0.999927
10630	1	0.999928
10640	3	0.999931
10650	2	0.999932
10660	1	0.999933
10680	1	0.999934
10690	2	0.999936
10700	1	0.999937
10710	4	0.999940
10760	1	0.999941
10940	1	0.999942
10970	1	0.999943
10980	1	0.999944
11010	2	0.999945
11030	1	0.999946
11100	1	0.999947
11110	1	0.999948
11160	1	0.999949
11170	2	0.999951
11180	2	0.999952
11200	1	0.999953
11210	1	0.999954
11220	2	0.999956
11240	2	0.999958
11250	1	0.999958
11260	1	0.999959
11280	2	0.999961
11290	1	0.999962
11300	1	0.999963
11310	2	0.999964
11330	3	0.999967
11340	4	0.999970
11350	2	0.999972
11360	1	0.999973
11380	2	0.999975
11400	1	0.999976
11410	1	0.999977
11430	1	0.999977
11440	1	0.999978
11520	1	0.999979
11640	2	0.999981
11920	1	0.999982
11930	1	0.999983
12090	2	0.999984
12100	1	0.999985
12110	2	0.999987
12170	1	0.999988
21850	2	0.999990
21980	1	0.999990
22000	1	0.999991
22030	1	0.999992
22040	1	0.999993
22080	2	0.999995
22190	1	0.999996
22210	1	0.999997
22220	1	0.999997
22230	1	0.999998
22260	1	0.999999
22270	1	1.000000
a_type	l_type	max	min	avg	cnt	percentage
0	0	114	0	6.638	58	0.00503%
1	0	11983	119	173.973	792560	68.77455%
2	0	857	262	350.914	512	0.04443%
3	0	22117	149	369.136	359338	31.18163%
--------------------------------------------
|            bench type:                   |
--------------------------------------------
----algorithm----
[0~100(usec)]: 0
[100~200(usec)]: 0
[200~300(usec)]: 0
[300~400(usec)]: 0
[400~500(usec)]: 0
[500~600(usec)]: 0
[600~700(usec)]: 0
[700~800(usec)]: 0
[800~900(usec)]: 0
[900~1000(usec)]: 0
[over_ms]: 0
[over__s]: 0
----lower----
[0~100(usec)]: 0
[100~200(usec)]: 0
[200~300(usec)]: 0
[300~400(usec)]: 0
[400~500(usec)]: 0
[500~600(usec)]: 0
[600~700(usec)]: 0
[700~800(usec)]: 0
[800~900(usec)]: 0
[900~1000(usec)]: 0
[over_ms]: 0
[over__s]: 0
----average----
[avg_algo]: 0.0
[avg_low]: 0.0
-----lower_info----
[write_op]: 0
[read_op]: 0
[trim_op]:0
[WAF, RAF]: 0.000000, 0.000000
[if rw test]: 0.000000(WAF), 0.000000(RAF)
[all write Time]:0.0
[all read Time]:0.0

----summary----
[all_time]: 0.0
[size]: 73689.820312(mb)
[FAIL NUM] 0
[SUCCESS RATIO] 1.000000
[throughput] inf(kb/s)
             inf(mb/s)
[cache hit cnt,ratio] 0, 0.000000
[cache hit cnt,ratio dftl] 0, 0.000000
[READ WRITE CNT] 1152403 8279829
error cnt:151
result of ms:
---
bye bye!
# of gc: 23
# of translation page gc: 23
# of data page gc: 0
# of translation page gc w/ data page gc: 0
# of translation page gc w/ read op: 0
# of evict: 762484
# of buf hit: 4
!!! print info !!!
BH: buffer hit, H: hit, R: read, MC: memcpy, CE: clean eviction, DE: dirty eviction, GC: garbage collection
a_type--->>> 0: BH, 1: H
2: R & MC, 3: R & CE & MC
4: R & DE & MC, 5: R & CE & GC & MC
6: R & DE & GC & MC
!!! print info !!!
Cache hit on read: 0
Cache miss on read: 0
Cache hit on write: 7227344
Cache miss on write: 327728

Clean hit on read: 607643
Dirty hit on read: 206882
Clean hit on write: 75930
Dirty hit on write: 7151414

% of miss : 0.08
# Clean eviction: 359338
# Dirty eviction: 403146

Clean eviciton on read: 359338
Dirty eviction on read: 0
Clean eviction on write: 0
Dirty eviction on write: 403146

Dirty eviction ratio: 52.87%
Dirty eviction ratio on read: 0.00%
Dirty eviction ratio on write: 100.00%

WAF: 1.35

0 23
1 1009264
2 403146
3 1675
4 1675
5 1152399
6 7555072
7 0
8 0
bdbm_mt max: 0
nohost: Wait for all the on-going jobs to finish...
nohost: [dm_nohost_close] MAP Download from HW!
nohost: [dm_nohost_close] closed!
write_q_hit:326826	read_q_hit:1	retry_hit:0